Revit 2016 API
WallFoundation Class
 An object that represents a wall foundation element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public class WallFoundation : HostObject
Visual Basic
Public Class WallFoundation _
	Inherits HostObject
Visual C++
public ref class WallFoundation : public HostObject
Examples
CopyC#
public void GetInfo_WallFoundation(WallFoundation wallFoundation)
{
    string message = "Wall Foundation : ";
    // Get Analytical model
    if (null != wallFoundation.GetAnalyticalModel())
    {
       message += "\nAnalytical model : " + wallFoundation.GetAnalyticalModel();
    }
    // Get Footing type name
    message += "\nFoundation type name is : " + wallFoundation.GetFoundationType().Name;
    TaskDialog.Show("Revit",message);
}
CopyVB.NET
Public Sub GetInfo_WallFoundation(wallFoundation As WallFoundation)
   Dim message As String = "Wall Foundation : "
   ' Get Analytical model
   If wallFoundation.GetAnalyticalModel() IsNot Nothing Then
      message += vbLf & "Analytical model : " & wallFoundation.GetAnalyticalModel().ToString()
   End If
   ' Get Footing type name
   message += vbLf & "Foundation type name is : " & Convert.ToString(wallFoundation.GetFoundationType().Name)
   TaskDialog.Show("Revit", message)
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.WallFoundation
See Also
WallFoundation Members
Autodesk.Revit.DB Namespace